package tk.sourenstepanyan;

/**
 * @author <a href="mailto:sourenstepanyan@gmail.com">Souren Stepanyan</a>
 */
public class AsciiToUnicode {

    public static void main(String[] args) {
        System.out.println("¦, §, ±,² ³, ´ µ, ¶ ·, ¸ ¹, º », ¼ ½, ¾ ¿, À Á, Â Ã, Ä Å, Æ Ç, È É, Ê Ë, Ì Í, Î Ï, Ð Ñ, Ò Ó, Ô Õ, Ö ×, Ø Ù, Ú Û, Ü Ý, Þ ß, à á, â ã, ä å, æ ç, è é, ê ë, ì í, î ï, ð ñ, ò ó, õ ö ÷, ø ù, ú û, ü ý");
        System.out.println(" |  |  |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |     |    |    |    | ");
        System.out.println("-|--|--|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|----|-----|----|----|----|-");
        System.out.println(" |  |  |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |    |     |    |    |    | ");
        System.out.println(Converter.asciiToUTF8("¦, §, ±,² ³, ´ µ, ¶ ·, ¸ ¹, º », ¼ ½, ¾ ¿, À Á, Â Ã, Ä Å, Æ Ç, È É, Ê Ë, Ì Í, Î Ï, Ð Ñ, Ò Ó, Ô Õ, Ö ×, Ø Ù, Ú Û, Ü Ý, Þ ß, à á, â ã, ä å, æ ç, è é, ê ë, ì í, î ï, ð ñ, ò ó, õ ö ÷, ø ù, ú û, ü ý"));
    }
}
